Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/wifi/driver/src/hal/rtl8735b/rtl8735b_hal.h
/******************************************************************************
 *
 * Copyright(c) 2016 Realtek Corporation. All rights reserved.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * this program; if not, write to the Free Software Foundation, Inc.,
 * 51 Franklin Street, Fifth Floor, Boston, MA 02110, USA
 *
 *
 ******************************************************************************/
#ifndef _RTL8735B_HAL_H_
#define _RTL8735B_HAL_H_

#include <osdep_service.h>		/* BIT(x) */
#include "halmac_api.h"	/* MAC REG definition */
#include "hal_data.h"
#include "rtl8735b_fw.h"
#include "rtl8735b_spec.h"
#include "rtl8735b_dm.h"
#include "rtl8735b_efuse.h"
#include "rtl8735b.h"
#include "phydm_precomp.h"

#ifdef CONFIG_SUPPORT_TRX_SHARED
#define FIFO_BLOCK_SIZE		32768 /*@Block size = 32K*/
#define RX_FIFO_EXPANDING	(1 * FIFO_BLOCK_SIZE)
#else
#define RX_FIFO_EXPANDING	0
#endif

#define GET_RF_TYPE(priv)			(GET_HAL_DATA(priv)->rf_type)

#define PHY_CFG_DCT_2G_A_P		"2g_a_p"
#define PHY_CFG_DCT_2G_A_N		"2g_a_n"
#define PHY_CFG_DCT_2G_CCK_A_P	"2g_cck_a_p"
#define PHY_CFG_DCT_2G_CCK_A_N	"2g_cck_a_n"

#define		DM_RATR_STA_INIT			0
#define		DM_RATR_STA_HIGH			1
#define 		DM_RATR_STA_MIDDLE		2
#define 		DM_RATR_STA_LOW			3
#if(DM_ODM_SUPPORT_TYPE & (ODM_AP|ODM_ADSL))
#define		DM_RATR_STA_ULTRA_LOW	4
#endif

typedef enum tag_Package_Definition {
	PACKAGE_10x10,
	PACKAGE_8x11
} PACKAGE_TYPE_E;

/* MP Functions */
#ifdef CONFIG_MP_INCLUDED
void rtl8735b_phy_init_haldm(PADAPTER);				/* rtw_mp.c */
void rtl8735b_prepare_mp_txdesc(PADAPTER, struct mp_priv *);	/* rtw_mp.c */
void rtl8735b_mp_config_rfpath(PADAPTER);			/* hal_mp.c */
#endif
void rtl8735b_recv_tasklet(void *priv);
void update_recvframe_phyinfo_8735b(union recv_frame	*precvframe, u8 *pphy_status);

#ifdef CONFIG_WOWLAN
int rtl8735b_suspend(int mode);
int rtl8735b_resume(int mode);
#endif

#endif /* _RTL8735B_HAL_H_ */
